responseTemplates/C2BPMEX.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <SOAP-ENV:Header>
        <gbo:UCBRUHeaders xmlns:gbo="urn:ucbru:gbo:v5">
            <gbo:Audit>
                <gbo:MessagePath>
                    <gbo:Step>
                        <gbo:Application.Module>SDPMTC2BPmtExec</gbo:Application.Module>
                        <gbo:VersionId>urn:ucbru:gbo:v5</gbo:VersionId>
                        <gbo:TimeStamp>2024-02-13T11:23:13.798+03:00</gbo:TimeStamp>
                        <gbo:RoutingRole>START</gbo:RoutingRole>
                        <gbo:Comment/>
                    </gbo:Step>
                    <gbo:Step>
                        <gbo:Application.Module>SDPMTC2BPmtExec</gbo:Application.Module>
                        <gbo:VersionId>urn:ucbru:gbo:v5</gbo:VersionId>
                        <gbo:TimeStamp>2024-02-13T11:23:26.784+03:00</gbo:TimeStamp>
                        <gbo:RoutingRole>SUCCESS</gbo:RoutingRole>
                        <gbo:Comment></gbo:Comment>
                    </gbo:Step>
                </gbo:MessagePath>
            </gbo:Audit>
        </gbo:UCBRUHeaders>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <sdpmt:SDPMTC2BPmtExec xmlns:sdpmt="urn:ucbru:gbo:v5:sdpmt">
            <sdpmt:Code>SUCCESS</sdpmt:Code>
            <sdpmt:Description>Ранее был получен отказ об оплате по этой платежной ссылке</sdpmt:Description>
            <sdpmt:BusinessMessageId>B4044082324692010000120011180902</sdpmt:BusinessMessageId>
        </sdpmt:SDPMTC2BPmtExec>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>